Natural_Reef_CFD/highRelief/Scenario_24/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          79;
        startFace       417681;
    }
    outlet
    {
        type            patch;
        nFaces          77;
        startFace       417760;
    }
    atmosphere
    {
        type            patch;
        nFaces          460;
        startFace       417837;
    }
    bathymetry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1761;
        startFace       418297;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          417870;
        startFace       420058;
    }
)

// ************************************************************************* //
